# 1.5. Housing in Brazil 🇧🇷

In [5]:
# Import Matplotlib, pandas, and plotly
import pandas as pd
import matplotlib.pyplot as plt
import plotly
import openpyxl

## Prepare Data

In this assignment, you'll work with real estate data from Brazil. In the data directory for this project there are two CSV that you need to import and clean, one-by-one.

### Import data

**Task 1.5.1: Import the CSV file data/brasil-real-estate-1.csv into the DataFrame df1.**

In [6]:
df = pd.read_excel('brasil-real-estate-1.xlsx')
df.head()

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd
0,1,apartment,|Brasil|Alagoas|Maceió|,Northeast,"-9.6443051,-35.7088142",110,187230.85
1,2,apartment,|Brasil|Alagoas|Maceió|,Northeast,"-9.6430934,-35.70484",65,81133.37
2,3,house,|Brasil|Alagoas|Maceió|,Northeast,"-9.6227033,-35.7297953",211,154465.45
3,4,apartment,|Brasil|Alagoas|Maceió|,Northeast,"-9.622837,-35.719556",99,146013.20
4,5,apartment,|Brasil|Alagoas|Maceió|,Northeast,"-9.654955,-35.700227",55,101416.71

**Task 1.5.2: Drop all rows with NaN values from the DataFrame df1.**

In [7]:
df.shape

(12834, 7)

In [8]:
df = df.dropna(axis='rows')

In [9]:
df.shape

(11551, 7)

**Task 1.5.3: Use the "lat-lon" column to create two separate columns in df1: "lat" and "lon". Make sure that the data type for these new columns is float.**

In [10]:
# split col [lat-lon] into [lat] & [lon]
df[['lat', 'lon']] = df['lat-lon'].str.split(',', expand=True).astype(float)

C:\Users\Asraful Islam\AppData\Local\Temp\ipykernel_9860\1193995130.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['lat', 'lon']] = df['lat-lon'].str.split(',', expand=True).astype(float)
C:\Users\Asraful Islam\AppData\Local\Temp\ipykernel_9860\1193995130.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['lat', 'lon']] = df['lat-lon'].str.split(',', expand=True).astype(float)

In [12]:
df = df.drop(columns='lat-lon', axis='columns')

In [13]:
df.head()

,Unnamed: 0,property_type,place_with_parent_names,region,area_m2,price_usd,lat,lon
0,1,apartment,|Brasil|Alagoas|Maceió|,Northeast,110,187230.85,-9.644305,-35.708814
1,2,apartment,|Brasil|Alagoas|Maceió|,Northeast,65,81133.37,-9.643093,-35.704840
2,3,house,|Brasil|Alagoas|Maceió|,Northeast,211,154465.45,-9.622703,-35.729795
3,4,apartment,|Brasil|Alagoas|Maceió|,Northeast,99,146013.20,-9.622837,-35.719556
4,5,apartment,|Brasil|Alagoas|Maceió|,Northeast,55,101416.71,-9.654955,-35.700227

**Task 1.5.4: Use the "place_with_parent_names" column to create a "state" column for df1. (Note that the state name always appears after "|Brasil|" in each string.)**

In [16]:
df['state'] = df.place_with_parent_names.str.split('|', expand=True)[2]

In [17]:
df['state'][0:10]

C:\Users\Asraful Islam\AppData\Local\Temp\ipykernel_9860\1071296700.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  df['state'][0:10]

0     Alagoas
1     Alagoas
2     Alagoas
3     Alagoas
4     Alagoas
5     Alagoas
6     Alagoas
7     Alagoas
9     Alagoas
10    Alagoas
Name: state, dtype: object

**Task 1.5.5: Transform the "price_usd" column of df1 so that all values are floating-point numbers instead of strings.**

In [18]:
df['price_usd'] = df['price_usd'].replace(['$', ','], '')

In [20]:
df['price_usd'] = pd.to_numeric(df['price_usd'])

In [22]:
df['price_usd'][0:10]

C:\Users\Asraful Islam\AppData\Local\Temp\ipykernel_9860\1819147476.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  df['price_usd'][0:10]

0     187230.85
1      81133.37
2     154465.45
3     146013.20
4     101416.71
5      75727.07
6     110916.18
7     249641.14
9     115459.02
10    361979.65
Name: price_usd, dtype: float64

**Task 1.5.6: Drop the "lat-lon" and "place_with_parent_names" columns from df1.**

In [24]:
df.drop(["place_with_parent_names"], axis='columns', inplace=True)

**Task 1.5.7: Import the CSV file brasil-real-estate-2.csv into the DataFrame df1**

In [25]:
df1 = pd.read_excel('brasil-real-estate-2.xlsx')

In [26]:
df1.head()

,Unnamed: 0,property_type,state,region,lat,lon,area_m2,price_brl
0,1,apartment,Pernambuco,Northeast,-8.134204,-34.906326,72.0,414222.98
1,2,apartment,Pernambuco,Northeast,-8.126664,-34.903924,136.0,848408.53
2,3,apartment,Pernambuco,Northeast,-8.125550,-34.907601,75.0,299438.28
3,4,apartment,Pernambuco,Northeast,-8.120249,-34.895920,187.0,848408.53
4,5,apartment,Pernambuco,Northeast,-8.142666,-34.906906,80.0,464129.36

**Task 1.5.8: Use the "price_brl" column to create a new column named "price_usd". (Keep in mind that, when this data was collected in 2015 and 2016, a US dollar cost 3.19 Brazilian reals.)**

In [27]:
df1['price_usd'] = df1.price_brl.transform(lambda x: x/3.19)

**Task 1.5.9: Drop the "price_brl" column from df2, as well as any rows that have NaN values.**

In [28]:
df1.drop('price_brl', axis='columns', inplace=True)

In [29]:
df1.isnull().sum()

Unnamed: 0          0
property_type       0
state               0
region              0
lat                 0
lon                 0
area_m2          1540
price_usd           0
dtype: int64

In [30]:
df1.dropna(how='any', inplace=True)

**Task 1.5.10: Concatenate df1 and df2 to create a new DataFrame named df.**

In [33]:
df.head()

,Unnamed: 0,property_type,region,area_m2,price_usd,lat,lon,state
0,1,apartment,Northeast,110,187230.85,-9.644305,-35.708814,Alagoas
1,2,apartment,Northeast,65,81133.37,-9.643093,-35.704840,Alagoas
2,3,house,Northeast,211,154465.45,-9.622703,-35.729795,Alagoas
3,4,apartment,Northeast,99,146013.20,-9.622837,-35.719556,Alagoas
4,5,apartment,Northeast,55,101416.71,-9.654955,-35.700227,Alagoas

In [34]:
df1.head()

,Unnamed: 0,property_type,state,region,lat,lon,area_m2,price_usd
0,1,apartment,Pernambuco,Northeast,-8.134204,-34.906326,72.0,129850.463950
1,2,apartment,Pernambuco,Northeast,-8.126664,-34.903924,136.0,265958.786834
2,3,apartment,Pernambuco,Northeast,-8.125550,-34.907601,75.0,93867.799373
3,4,apartment,Pernambuco,Northeast,-8.120249,-34.895920,187.0,265958.786834
4,5,apartment,Pernambuco,Northeast,-8.142666,-34.906906,80.0,145495.097179

In [32]:
frame = [df, df1]
data = pd.concat(frame)
print("df shape:", data.shape)

df shape: (22844, 8)

In [35]:
data.head()

,Unnamed: 0,property_type,region,area_m2,price_usd,lat,lon,state
0,1,apartment,Northeast,110.0,187230.85,-9.644305,-35.708814,Alagoas
1,2,apartment,Northeast,65.0,81133.37,-9.643093,-35.704840,Alagoas
2,3,house,Northeast,211.0,154465.45,-9.622703,-35.729795,Alagoas
3,4,apartment,Northeast,99.0,146013.20,-9.622837,-35.719556,Alagoas
4,5,apartment,Northeast,55.0,101416.71,-9.654955,-35.700227,Alagoas